app/Http/Controllers/Api/User/BankAccountController.php

    public function index(){
        $bank_list      = Bank::where('status',true)->orderBy('id','desc')->get()->map(function($data){
            return [
                'id'            => $data->id,
                'slug'          => $data->slug,
                'bank_name'     => $data->bank_name,
                'desc'          => $data->desc,
                'input_fields'  => $data->input_fields
            ];
        });
        $bank_account      = BankAccount::auth()->with(['bank'])->first();
---
select * from `banks` where `status` = 1 order by `id` desc
select * from `bank_accounts` where `user_id` = 1 order by `created_at` desc limit 1
select * from `banks` where `banks`.`id` in (1)

    public function store(Request $request){

        $validator              = Validator::make($request->all(),[
            'bank_id'           => 'required',
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }

        $bank_fields                    = Bank::where('id',$request->bank_id)->first()->input_fields ?? [];
        $validation_rules               = $this->generateValidationRules($bank_fields);
        $validated                      = Validator::make($request->all(),$validation_rules);
        if ($validated->fails()) {
            $message =  ['error' => $validated->errors()->all()];
            return Helpers::error($message);
        }
        $validated = $validated->validate();
        $get_values                     = $this->placeValueWithFields($bank_fields,$validated);
        $validated['user_id']           = auth()->user()->id;
        $validated['bank_id']           = $request->bank_id;
        $validated['credentials']       = $get_values;
        $user_account                   = BankAccount::where('user_id',auth()->user()->id)->where('status',BankAccountConst::PENDING)->count();
---
select * from `banks` where `id` = '1' limit 1
select count(*) as aggregate from `bank_accounts` where `user_id` = 1 and `status` = 1