app/Http/Controllers/Api/User/SendMoneyController.php

    public function confirmedSendMoney(Request $request){
        $validator = Validator::make(request()->all(), [
            'amount'            => 'required|numeric|gt:0',
            'email'             => 'required|email',
            'payment_method'    => 'required',
            'sender_email'      => 'nullable',
            'currency'          => 'required'
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $basic_setting = BasicSettings::first();
---
select * from `basic_settings` limit 1

        $sender_email       = $request->sender_email;
        $user               = auth()->user();

        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $payment_gateway    = SendMoneyGateway::where('id',$request->payment_method)->first();

        $receiver_info      = User::where('email',$receiver_email)->first();
---
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `send_money_gateways` where `id` = '2' limit 1
select * from `users` where `email` = 'user2@appdevs.net' limit 1


        $this_month_start   = date('Y-m-01');
        $this_month_end     = date('Y-m-t');
        $this_month_send_money  = Transaction::where('type',PaymentGatewayConst::TYPETRANSFERMONEY)->whereDate('created_at',">=" , $this_month_start)
                            ->whereDate('created_at',"<=" , $this_month_end)
                            ->sum('request_amount');
---
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'TRANSFER-MONEY' and date(`created_at`) >= '2024-03-01' and date(`created_at`) <= '2024-03-31'

            $user           = null;
        }

        $receiver_wallet             = UserWallet::where('user_id',$receiver_info->id)->first();
---
select * from `user_wallets` where `user_id` = 2 limit 1

            $error = ['error'=>[__("Something went wrong! Please try again.")]];
            return Helpers::error($error);
        }
        $payment_gateway = SendMoneyGateway::where('id',$temporary_data->data->payment_gateway)->first();
---
select * from `send_money_gateways` where `id` = 2 limit 1

            }

            $trx = $instance['response']['id']??$instance['response']['trx']??$instance['response']['reference_id']??$instance['response']['order_id']??$instance['response'];
            $temData = TemporaryData::where('identifier',$trx)->first();
---
select * from `temporary_datas` where `identifier` = '7JL760151E105752D' limit 1