app/Http/Controllers/Api/User/TransactionController.php

    public function index($slug = null) {

        // start transaction now
        $bill_pay           = Transaction::auth()->billPay()->orderByDesc("id")->get();
        $mobileTopUp        = Transaction::auth()->mobileTopup()->orderByDesc("id")->get();
        $addMoney           = Transaction::auth()->addMoney()->orderByDesc("id")->latest()->get();
        $walletToBank       = Transaction::auth()->walletToBank()->orderByDesc("id")->latest()->get();
        $moneyOut           = Transaction::auth()->moneyOut()->orderByDesc("id")->get();
        $sendMoney          = Transaction::auth()->senMoney()->orderByDesc("id")->get();
        $moneyIn            = Transaction::auth()->moneyIn()->orderByDesc("id")->get();
        $agentMoneyOut      = Transaction::auth()->agentMoneyOut()->orderByDesc("id")->get();
        $requestMoney       = Transaction::auth()->requestMoney()->orderByDesc("id")->get();
        $payLink            = Transaction::auth()->payLink()->orderByDesc('id')->get();
        $virtualCard        = Transaction::auth()->virtualCard()->orderByDesc("id")->get();
        $remittance         = Transaction::auth()->remitance()->orderByDesc("id")->get();
        $merchant_payment   = Transaction::auth()->merchantPayment()->orderByDesc("id")->get();
        $make_payment       = Transaction::auth()->makePayment()->orderByDesc("id")->get();
        $addSubBalance      = Transaction::auth()->addSubBalance()->orderByDesc("id")->get();
---
select * from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY' order by `id` desc
select * from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' order by `id` desc, `created_at` desc
select * from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' order by `id` desc, `created_at` desc
select * from `transactions` where `user_id` = 1 and `type` = 'WALLET_TO_BANK' order by `id` desc, `created_at` desc
select * from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'TRANSFER-MONEY' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'MONEY-IN' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'AGENT-MONEY-OUT' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'REQUEST-MONEY' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'PAY-LINK' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'MERCHANT-PAYMENT' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'MAKE-PAYMENT' order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'ADD-SUBTRACT-BALANCE' order by `id` desc