app/Http/Controllers/User/BankAccountController.php

select * from `bank_accounts` where `user_id` = 1 and `status` = 2 limit 1
select * from `bank_accounts` where `user_id` = 1 and `status` = 1 limit 1
select * from `banks` where `status` = 1 order by `id` desc
---
    public function index(){
        $page_title                 = __("Bank Account");
        $bank_account_approved      = BankAccount::auth()->where('status',BankAccountConst::APPROVED)->first();
        $bank_account_pending       = BankAccount::auth()->where('status',BankAccountConst::PENDING)->first();
        $banks                      = Bank::where('status',true)->orderBy('id','desc')->get();

select * from `banks` where `id` = '1' limit 1
---
    public function store(Request $request){
        $bank_fields                = Bank::where('id',$request->bank)->first()->input_fields ?? [];

select * from `bank_accounts` where `user_id` = 1 and `id` = '1' limit 1
delete from `bank_accounts` where `id` = 1
---
    public function delete(Request $request,$id){
        $bank_account   = BankAccount::where('id',$id)->first();
        if(!$bank_account) return back()->with(['error' => ['Sorry! Data not found.']]);
        try{
            $bank_account->delete();