app/Http/Controllers/User/SendMoneyController.php

select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'TRANSFER-MONEY' order by `created_at` desc limit 10
select * from `send_money_gateways` where `slug` = 'google-pay' and `status` = 1 limit 1
select * from `send_money_gateways` where `slug` = 'paypal' and `status` = 1 limit 1
select * from `send_money_gateways` where `slug` = 'apple-pay' and `status` = 1 limit 1
---
    public function index() {
        $page_title         = __("Send Money");
        $sendMoneyCharge    = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $transactions       = Transaction::auth()->senMoney()->latest()->take(10)->get();
        $google_pay_gateway = SendMoneyGateway::where('slug',global_const()::GOOGLE_PAY)->where('status',true)->first();
        $paypal_gateway     = SendMoneyGateway::where('slug',global_const()::PAYPAL)->where('status',true)->first();
        $apple_pay_gateway  = SendMoneyGateway::where('slug',global_const()::APPLE_PAY)->where('status',true)->first();

select * from `basic_settings` limit 1
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `send_money_gateways` where `id` = '2' limit 1
select * from `users` where `email` = 'user2@appdevs.net' limit 1
---
    public function handlePaymentConfirmation(Request $request){
        $request->validate([
            'amount'           => 'required|numeric|gt:0',
            'receiverEmail'    => 'required|email',
            'paymentMethod'    => 'required',
            'senderEmail'      => 'nullable'
        ]);
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return Response::error([__('Please submit kyc information!')],[],404);
            }elseif($user->kyc_verified == 2){
                return Response::error([__('Please wait before admin approved your kyc information')],[],404);
            }elseif($user->kyc_verified == 3){
                return Response::error([__('Admin rejected your kyc information, Please re-submit again')],[],404);
            }
        }
        $amount             = floatval($request->amount);
        $currency           = $request->currency;
        $receiver_email     = $request->receiverEmail;
        $sender_email       = $request->senderEmail;
        $user               = auth()->user();
        $sendMoneyCharge    = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $payment_gateway    = SendMoneyGateway::where('id',$request->paymentMethod)->first();


        $receiver_info      = User::where('email',$receiver_email)->first();

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'TRANSFER-MONEY' and date(`created_at`) >= '2024-03-01' and date(`created_at`) <= '2024-03-31'
---

        $this_month_start   = date('Y-m-01');
        $this_month_end     = date('Y-m-t');
        $this_month_send_money  = Transaction::where('type',PaymentGatewayConst::TYPETRANSFERMONEY)->whereDate('created_at',">=" , $this_month_start)
                            ->whereDate('created_at',"<=" , $this_month_end)
                            ->sum('request_amount');

select * from `user_wallets` where `user_id` = 2 limit 1
---
            $authenticated  = false;
        }

        $receiver_wallet             = UserWallet::where('user_id',$receiver_info->id)->first();

select * from `send_money_gateways` where `id` = 2 limit 1
---
        }catch(Exception $e){
            return Response::error([__('Something went wrong! Please try again.')],[],404);
        }
        $payment_gateway = SendMoneyGateway::where('id',$temporary_data->data->payment_gateway)->first();

select * from `temporary_datas` where `identifier` = '8CA24697NJ711572R' limit 1
---
    public function success(Request $request, $gateway){
        $requestData = $request->all();

        $token = $requestData['token'] ?? "";
        $checkTempData = TemporaryData::where("identifier",$token)->first();