app/Http/Controllers/User/WalletToBankController.php

    public function index(){
        $page_title     = "Wallet To Bank Transfer";
        $bank           = BankAccount::auth()->with(['bank'])->where('status',bank_account_const()::APPROVED)->first();
        $transactions   = Transaction::auth()->walletToBank()->latest()->take(10)->get();
---
select * from `bank_accounts` where `user_id` = 1 and `status` = 2 limit 1
select * from `banks` where `banks`.`id` in (1)
select * from `transactions` where `user_id` = 1 and `type` = 'WALLET_TO_BANK' order by `created_at` desc limit 10