app/Http/Helpers/helpers.php

function get_admin_notifications()
{
    $notifications = AdminNotification::auth()->where('clear_at',null)->latest()->get();
---
select * from `admin_notifications` where `admin_id` = 1 and `clear_at` is null order by `created_at` desc

function get_user_notifications()
{
    if(auth()->guard('web')->check()){
        $notifications = UserNotification::auth()->latest()->take(5)->get();
    } else if(auth()->guard('merchant')->check()){
        $notifications = MerchantNotification::auth()->latest()->take(5)->get();
    }else if(auth()->guard('agent')->check()){
        $notifications = AgentNotification::auth()->latest()->take(5)->get();
---
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 5

function authWalletBalance(){
    if(auth()->guard('web')->check()){
        $wallet = UserWallet::where('user_id',auth()->user()->id)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1

function module_access_api($key)
{
    $module = ModuleSetting::where('slug',$key)->first();
---
select * from `module_settings` where `slug` = 'send-money' limit 1

function module_access_merchant_api($key)
{
    $module = ModuleSetting::where('slug',$key)->first();
---
select * from `module_settings` where `slug` = 'send-money' limit 1

function flutterwaveBalance($secret_key = null){

    $cardApi = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

function totalAdminProfits(){

    $total_profits = TransactionCharge::with('transactions')
    ->whereHas('transactions', function ($query) {
        $query->whereNotIn('type', [PaymentGatewayConst::TYPEADDMONEY, PaymentGatewayConst::TYPEMONEYOUT,PaymentGatewayConst::TYPEADDSUBTRACTBALANCE]);
    })
    ->sum('total_charge');
---
select sum(`total_charge`) as aggregate from `transaction_charges` where exists (select * from `transactions` where `transaction_charges`.`transaction_id` = `transactions`.`id` and `type` not in ('ADD-MONEY', 'MONEY-OUT', 'ADD-SUBTRACT-BALANCE'))

 function activeCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::toBase()->count();
        $active_cards =  VirtualCard::toBase()->where('is_active',1)->count();
        $inactive_cards = VirtualCard::toBase()->where('is_active',0)->count();
    }elseif(virtual_card_system('sudo') == "sudo"){
        $virtual_cards = SudoVirtualCard::toBase()->count();
---
select count(*) as aggregate from `virtual_cards` where `is_active` = 1
select count(*) as aggregate from `virtual_cards`