app/Http/Helpers/SendMoneyGateway.php

select * from `send_money_gateways` where `slug` = 'paypal' limit 1
select * from `temporary_datas` where `identifier` = '\"721242e4-9ede-423c-b9ae-7e86947b2a2f\"' limit 1
---
    public function gateway() {
        $request_data = $this->request_data;
        if(empty($request_data)) throw new Exception(__("Gateway Information is not available."));
        $validated = $this->validator($request_data)->validate();
        $gateway_currency = AdminSendMoneyGateway::where("slug",$validated[$this->send_money_gateway])->first();
        $data = TemporaryData::where("identifier",$validated[$this->temporary_data_identifier])->first();

select * from `temporary_datas` where `identifier` = '4ab2b998-b20f-41d1-83c8-e038ed8dc643' limit 1
select * from `send_money_gateways` where `send_money_gateways`.`id` = 2 limit 1
---
    public function responseReceive($type = null) {
        $tempData = $this->request_data;

        if(empty($tempData) || empty($tempData['type'])) throw new Exception(__('Transaction Failed. Record didn\'t saved properly. Please try again'));

        $method_name = $tempData['type']."SendMoneySuccess";
        $send_money_data = TemporaryData::where('identifier',$tempData['data']->user_record)->first();
        if($send_money_data->data->authenticated == true){
            if($this->requestIsApiUser()) {
                $creator_table = $tempData['data']->creator_table ?? null;
                $creator_id = $tempData['data']->creator_id ?? null;
                $creator_guard = $tempData['data']->creator_guard ?? null;
                $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
                if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception(__("Request user doesn\'t save properly. Please try again"));
                if($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception(__("Request user doesn\'t save properly. Please try again"));
                $creator = DB::table($creator_table)->where("id",$creator_id)->first();
                if(!$creator) throw new Exception(__("Request user doesn\'t save properly. Please try again"));
                $api_user_login_guard = $api_authenticated_guards[$creator_guard];
                $this->output['api_login_guard'] = $api_user_login_guard;
                Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
            }
        }
        $gateway_id = $tempData['data']->gateway ?? "";
        $gateway_currency = AdminSendMoneyGateway::find($gateway_id);