app/Traits/SendMoney/Paypal.php

select * from `temporary_datas` where `identifier` = '\"721242e4-9ede-423c-b9ae-7e86947b2a2f\"' limit 1
---
    public function sendMoneyPaypalInitApi($output = null) {
        if(!$output) $output = $this->output;
        $credentials = $this->getPaypalCredentials($output);

        $config = $this->paypalConfig($credentials,$output['amount']);
        $paypalProvider = new PayPalClient;
        $paypalProvider->setApiCredentials($config);
        $paypalProvider->getAccessToken();
        $response = $paypalProvider->createOrder([
            "intent" => "CAPTURE",
            "application_context" => [
                "return_url" =>route('api.send.money.payment.success',PaymentGatewayConst::PAYPAL."?r-source=".PaymentGatewayConst::APP),
                "cancel_url" => route('api.send.money.payment.cancel',PaymentGatewayConst::PAYPAL."?r-source=".PaymentGatewayConst::APP),
            ],
            "purchase_units" => [
                0 => [
                    "amount" => [
                        "currency_code" => $output['amount']->sender_cur_code ?? '',
                        "value" => $output['amount']->total_amount ? number_format($output['amount']->total_amount,2,'.','') : 0,
                    ]
                ]
            ]
        ]);

        if(isset($response['id']) && $response['id'] != "" && isset($response['status']) && $response['status'] == "CREATED" && isset($response['links']) && is_array($response['links'])) {
            foreach($response['links'] as $item) {
                if($item['rel'] == "approve") {
                    $data  = TemporaryData::where('identifier',$output['form_data']['identifier'])->first();

select * from `basic_settings` limit 1
---
    public function paypalPaymentCaptured($response,$output) {
        // payment successfully captured record saved to database

        $output['capture'] = $response;
        $basic_setting = BasicSettings::first();

select * from `transactions` where `id` = 1 limit 1
---
    public function createTransaction($output, $trx_id) {
        $trx_id =  $trx_id;
        $inserted_id = $this->insertRecord($output, $trx_id);
        $this->insertReceiver($output, $trx_id);
        $this->insertCharges($output,$inserted_id);

        // $this->removeTempData($output);


        if($this->requestIsApiUser()) {
            // logout user
            $api_user_login_guard = $this->output['api_login_guard'] ?? null;
            if($api_user_login_guard != null) {
                auth()->guard($api_user_login_guard)->logout();
            }
        }
        $transaction_data = Transaction::where('id',$inserted_id)->first();

select * from `temporary_datas` where `identifier` = '4ab2b998-b20f-41d1-83c8-e038ed8dc643' limit 1
---
    public function insertRecord($output, $trx_id) {
        $trx_id =  $trx_id;
        $token = $this->output['tempData']['identifier'] ?? "";
        $data  = TemporaryData::where('identifier',$output['form_data']['identifier'])->first();

select * from `temporary_datas` where `identifier` = '4ab2b998-b20f-41d1-83c8-e038ed8dc643' limit 1
select * from `user_wallets` where `user_id` = 2 limit 1
---
    public function insertReceiver($output, $trx_id) {
        $trx_id =  $trx_id;
        $token = $this->output['tempData']['identifier'] ?? "";
        $data  = TemporaryData::where('identifier',$output['form_data']['identifier'])->first();
        $receiver = UserWallet::where('user_id',$data->data->receiver_wallet->user_id)->first();

select * from `user_wallets` where `user_id` = 2 limit 1
update `user_wallets` set `balance` = 1020, `user_wallets`.`updated_at` = '2024-03-22 16:04:29' where `id` = 2
---
    function updateWalletBalance($data){
        $receiver_wallet = UserWallet::where('user_id',$data->data->receiver_wallet->user_id)->first();
        if(!$receiver_wallet) return back()->with(['error' => ['Wallet not found.']]);

        $balance = floatval($receiver_wallet->balance) + floatval($data->data->amount);
        $receiver_wallet->update([
            'balance'   => $balance,
        ]);

select * from `temporary_datas` where `identifier` = '4ab2b998-b20f-41d1-83c8-e038ed8dc643' limit 1
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (1, 0.2, 1, 1.2, '2024-03-22 16:04:29')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Send Money\",\"message\":\"Transfer Money to user2@appdevs.net 20 USD Successful\"}', '2024-03-22 16:04:29', '2024-03-22 16:04:29')
---
    public function insertCharges($output,$id) {

        $data  = TemporaryData::where('identifier',$output['form_data']['identifier'])->first();
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $output['amount']->percent_charge,
                'fixed_charge'      => $output['amount']->fixed_charge,
                'total_charge'      => $output['amount']->total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money to')." ".$data->data->receiver_email.' ' .$data->data->amount.' '.get_default_currency_code()." ".__('Successful'),

            ];
            if(auth()->check()){
                UserNotification::create([
                    'type'      => NotificationConst::TRANSFER_MONEY,
                    'user_id'  => auth()->user()->id,
                    'message'   => $notification_content,
                ]);