app/Http/Controllers/SiteController.php

    public function home(){

        $basic_settings = BasicSettings::first();
        $page_title = $basic_settings->site_title??"Home";
        $app_urls = AppSettings::first();
---
select * from `basic_settings` limit 1
select * from `app_settings` limit 1

    public function sendMoney(Request $request){

        $page_title         = "Send Money";
        $sendMoneyCharge    = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $google_pay_gateway = SendMoneyGateway::where('slug',global_const()::GOOGLE_PAY)->where('status',true)->first();
        $paypal_gateway     = SendMoneyGateway::where('slug',global_const()::PAYPAL)->where('status',true)->first();
        $apple_pay_gateway  = SendMoneyGateway::where('slug',global_const()::APPLE_PAY)->where('status',true)->first();
---
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `send_money_gateways` where `slug` = 'google-pay' and `status` = 1 limit 1
select * from `send_money_gateways` where `slug` = 'paypal' and `status` = 1 limit 1
select * from `send_money_gateways` where `slug` = 'apple-pay' and `status` = 1 limit 1

    public function handlePaymentConfirmation(Request $request){
        $request->validate([
            'amount'           => 'required|numeric|gt:0',
            'receiverEmail'    => 'required|email',
            'paymentMethod'    => 'required',
            'senderEmail'      => 'nullable'
        ]);
        $basic_setting = BasicSettings::first();

        $amount             = floatval($request->amount);
        $currency           = $request->currency;
        $receiver_email     = $request->receiverEmail;
        $sender_email       = $request->senderEmail;

        $sendMoneyCharge    = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $payment_gateway    = SendMoneyGateway::where('id',$request->paymentMethod)->first();

        $receiver_info      = User::where('email',$receiver_email)->first();
---
select * from `basic_settings` limit 1
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `send_money_gateways` where `id` = '2' limit 1
select * from `users` where `email` = 'user@appdevs.net' limit 1


        $this_month_start   = date('Y-m-01');
        $this_month_end     = date('Y-m-t');
        $this_month_send_money  = Transaction::where('type',PaymentGatewayConst::TYPETRANSFERMONEY)->whereDate('created_at',">=" , $this_month_start)
                            ->whereDate('created_at',"<=" , $this_month_end)
                            ->sum('request_amount');
---
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'TRANSFER-MONEY' and date(`created_at`) >= '2024-03-01' and date(`created_at`) <= '2024-03-31'

            $authenticated  = false;
            $user           = null;
        }
        $receiver_wallet             = UserWallet::where('user_id',$receiver_info->id)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1

        }catch(Exception $e){
            return Response::error([__('Something went wrong! Please try again.')],[],404);
        }
        $payment_gateway = SendMoneyGateway::where('id',$temporary_data->data->payment_gateway)->first();
---
select * from `send_money_gateways` where `id` = 2 limit 1