app/Http/Controllers/Admin/BankController.php

    public function index(){
        $page_title     = "All Bank Methods";
        $banks          = Bank::orderBy('id','desc')->get();
---
select * from `banks` order by `id` desc

        ]);
        if($validator->fails()) return back()->withErrors($validator)->withInput($request->all());
        $validated                  = $validator->validate();
        if(Bank::where('bank_name',$validated['bank_name'])->exists()){
---
select exists(select * from `banks` where `bank_name` = 'Nagad') as `exists`

        }

        try{
            Bank::create($validated);
---
insert into `banks` (`bank_name`, `currency_name`, `currency_code`, `currency_symbol`, `min_limit`, `max_limit`, `fixed_charge`, `percent_charge`, `rate`, `desc`, `image`, `slug`, `input_fields`, `updated_at`, `created_at`) values ('Nagad', 'Afghan afghani', 'AFN', '$', '100', '1000000', '2', '1', '80', '<p>sdfsdf</p>', '48334716-85d5-4286-bc9f-ca72f073c714.webp', 'nagad', '[{\"type\":\"text\",\"label\":\"Account Number\",\"name\":\"account_number\",\"required\":true,\"validation\":{\"max\":\"30\",\"mimes\":[],\"min\":\"0\",\"options\":[],\"required\":true}}]', '2024-03-25 07:46:03', '2024-03-25 07:46:03')

    public function edit($slug){
        $page_title     = "Edit Bank Method";
        $bank           = Bank::where('slug',$slug)->first();
---
select * from `banks` where `slug` = 'emirates-islamic-bank' limit 1

    public function update(Request $request,$slug){
        $data       = Bank::where('slug',$slug)->first();
---
select * from `banks` where `slug` = 'nagad' limit 1


        if($validator->fails()) return back()->withErrors($validator)->withInput($request->all());
        $validated                      = $validator->validate();
        if(Bank::whereNot('id',$data->id)->where('bank_name',$validated['bank_name'])->exists()){
---
select exists(select * from `banks` where not `id` = 1 and `bank_name` = 'Nagad') as `exists`

    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:banks,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();


        $bank = Bank::find($validated['data_target']);

        try{
            $bank->update([
                'status'        => ($validated['status']) ? false : true,
            ]);
---
select * from `banks` where `banks`.`id` = '1' limit 1
update `banks` set `status` = 1, `banks`.`updated_at` = '2024-03-21 17:19:32' where `id` = 1