app/Http/Controllers/Admin/BankAccountVerificationController.php

    public function pending(){
        $page_title     = "Pending Bank Accounts";
        $data           = BankAccount::with(['user','bank'])->where('status',BankAccountConst::PENDING)->get();
---
select * from `bank_accounts` where `status` = 1
select * from `banks` where `banks`.`id` in (1)
select * from `users` where `users`.`id` in (1)

    public function details($id){
        $page_title     = "Bank Account Details";
        $data           = BankAccount::with(['user','bank'])->where('id',$id)->first();
---
select * from `bank_accounts` where `id` = '1' limit 1
select * from `banks` where `banks`.`id` in (1)
select * from `users` where `users`.`id` in (1)

    public function statusApproved(Request $request,$id){
        $basic_settings     = BasicSettings::first();
        $validator = Validator::make($request->all(),[
            'status'            => 'required|integer',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated      = $validator->validate();
        $bank_data      = BankAccount::with(['user','bank'])->where('id',$id)->first();

        $form_data = [
            'data'        => $bank_data,
            'status'      => 'Approved',
        ];
        try{
            $bank_data->update([
                'status'    => $validated['status'],
            ]);
---
select * from `basic_settings` limit 1
select * from `bank_accounts` where `id` = '2' limit 1
select * from `banks` where `banks`.`id` in (1)
select * from `users` where `users`.`id` in (1)
update `bank_accounts` set `status` = '2', `bank_accounts`.`updated_at` = '2024-03-21 12:40:09' where `id` = 2

    public function reject(){
        $page_title     = "Rejected Bank Accounts";
        $data           = BankAccount::with(['user','bank'])->where('status',BankAccountConst::REJECTED)->get();
---
select * from `bank_accounts` where `status` = 3
select * from `banks` where `banks`.`id` in (21)
select * from `users` where `users`.`id` in (1)