app/Http/Controllers/Admin/BankTransactionController.php

    public function index(){
        $page_title     = "All Bank Transactions";
        $transactions   = Transaction::walletToBank()->orderBy('id','desc')->paginate(10);
---
select * from `transactions` where `type` = 'WALLET_TO_BANK' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `transactions` where `type` = 'WALLET_TO_BANK'

    public function details($trx_id){
        $page_title = "Bank Transaction Details";
        $data   = Transaction::walletToBank()->where('trx_id',$trx_id)->first();
        if(!$data) return back()->with(['error' => ['Sorry data not found!']]);
---
select * from `transactions` where `type` = 'WALLET_TO_BANK' and `trx_id` = 'WTB21175352' limit 1
select * from `transactions` where `type` = 'WALLET_TO_BANK' and `trx_id` = 'WTB82577514' limit 1