app/Http/Controllers/Admin/SendMoneyLogController.php

select * from `transactions` where `trx_id` = 'SM71187555' limit 1
---
    public function details($trx_id){
        $data   = Transaction::where('trx_id',$trx_id)->first();