app/Http/Controllers/Admin/TrxSettingsController.php

    public function index()
    {
        $page_title = __("Fees & Charges");
        $transaction_charges = TransactionSetting::all();
---
select * from `transaction_settings`